Workspace/test_cases/00-ParaFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs ("libvelocityOutletNSCBCx.so" "libvelocityOutletNSCBCy.so" "libvelocityOutletNSCBCz.so"  "libwaveTransmision.so" "libpressureOutletNSCBC.so" "libtemperatureOutletNSCBC.so");
application     rhoCentralFoam;

startFrom    startTime;

startTime    0;

stopAt          endTime;

endTime    0.05;

deltaT     1.0e-9;

writeControl  adjustableRunTime;//  adjustable;

writeInterval    1.0e-6;

purgeWrite    0;

writeFormat    binary;

writePrecision   8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable    true;

adjustTimeStep  yes;

maxCo           0.25;

maxDeltaT       1e-5;

functions
{
    #include "FOMachNo"
    #include "FOyPlus"
    #include "FOforces"
    #include "FOpressure"
    #include "FOsurfaceSample"
    #include "FOIDDES"
}

// ************************************************************************* //
