Workspace/test_cases/00-ParaFoam/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
ptotal      101325;
Mach        1.05;
soundSpeed  343.1143;  // sqrt(gamma*R*T)
vinlet      #eval{$soundSpeed*$Mach};
pinlet      #eval{$ptotal - 0.5*1.225*$vinlet*$vinlet};
poutlet     73048;

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $poutlet;

boundaryField
{
    INLET
    {
      //	type zeroGradient;
       type            totalPressure;
       psi             thermo:psi;  
       gamma           1.4;      
       p0              uniform $ptotal;
       value           uniform $pinlet;

    }
    OUTLET
    {
    //    type           fixedMean;
    //    meanValue      $pOut;
    //    value          uniform 1e5;
        type            pressureOutletNSCBC;
        field           p;
        gamma           1.4;
        fieldInf        1;
        lInf            1;
        pInf            $poutlet;
        etaAc           1;
        value           $internalField;

//        type            waveTransmissive;
//        field           p;
//        psi             thermo:psi;
//        gamma           1.4;
//        fieldInf        100000;
//        lInf            1e-5;
//        value           uniform 100000;
    }
    row_1_PER1
    {
        type            cyclic;
    }
    row_1_PER2
    {
        type            cyclic;

    }
    Blade
    {
        type             zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
