Workspace/test_cases/00-ParaFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|U|k|omega|e|epsilon|R|nuTilda)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.001;
        minIter         2;
    }
    pFinal
    {
        $p;
        relTol          0;
    }
    "rho.*"
    {
	solver diagonal;		
    }
    "(rho|U|k|omega|e|epsilon|R|nuTilda)Final"
    {
        $U;
        relTol          0;
    }


}

PIMPLE
{

    transonic           yes;
    nOuterCorrectors    3;
    nCorrectors         1;
    nNonOrthogonalCorrectors 1;
    consistent          yes;
    momentumPredictor   yes;
}

relaxationFactors
{
    equations
    {
        ".*"     1;
    }
}

// ************************************************************************* //
